package UI;

public class Data {
 
    public static int[][] CountryBound = 
    { 
        {30 , 72},          //0
        {73 , 103},          //1  
        {124 , 165},          //2
        {220 , 70},          //3
        {76 , 152},          //4
        {171 , 160},          //5
        {68 , 216},          //6
        {140 , 240},          //7
        {126 , 330},          //8
        {195 , 380},          //9
        {255 , 427},          //10
        {220 , 482},          //11
        {377 , 306},          //12
        {444 , 309},          //13
        {428 , 386},          //14
        {469 , 390},          //15
        {440 , 447},          //16
        {497 , 436},          //17
        {330 , 112},          //18
        {420 , 110},          //19
        {367 , 162},          //20
        {414 , 171},          //21
        {370 , 212},          //22
        {419 , 204},          //23
        {455 , 155},          //24
        {539 , 116},          //25
        {581 , 94},          //26
        {642 , 56},          //27
        {704 , 55},          //28
        {638 , 125},          //29
        {634 , 184},          //30
        {603 , 224},          //31
        {567 , 266},          //32
        {620 , 278},          //33
        {486 , 265},          //34
        {702 , 215},          //35
        {524 , 193},          //36
        {651 , 358},          //37
        {716 , 366},          //38
        {684 , 442},          //39
        {724 , 444},          //40
        {755 , 503},          //41
        
    };

    public static String[] CountryName = 
    {
        "NAmerica.1",
        "NAmerica.2",
        "NAmerica.3",
        "NAmerica.4",
        "NAmerica.5",
        "NAmerica.6",
        "NAmerica.7",
        "NAmerica.8",
        "NAmerica.9",
        "SAmerica.1",
        "SAmerica.2",
        "SAmerica.3",
        "SAmerica.4",
        "Africa.1",
        "Africa.2",
        "Africa.3",
        "Africa.4",
        "Africa.5",
        "Africa.6",
        "Europe.1",
        "Europe.2",
        "Europe.3",
        "Europe.4",
        "Europe.5",
        "Europe.6",
        "Europe.7",
        "Asia.1",
        "Asia.2",
        "Asia.3",
        "Asia.4",
        "Asia.5",
        "Asia.6",
        "Asia.7",
        "Asia.8",
        "Asia.9",
        "Asia.10",
        "Asia.11",
        "Asia.12",
        "Asia.13",
        "Australia.1",
        "Australia.2",
        "Australia.3",
        "Australia.4",
        "Australia.5",
        
    };


    //در ایدی همسایه های هر کشور ردیف های فرد ایدی کشور اصلی و ردیف بعدی آن یعنی ردیف زوج ایذی همسایه ها میباشد
    public static int[][] NeighbourId = 
    {
        {0} ,
        {1 , 4 , 28},
        {1} ,
        {0 , 4 , 2 , 3}
        
    };
}